const { state } = require('./core')

const startWhiteBoard = `#️⃣   [A][B][C][D] [E][F][G][H]   #️⃣

8️⃣   ✊🏿🐴💂🏿👸🏿🤴🏿💂🏿🐴✊🏿   8️⃣
7️⃣   👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️   7️⃣
6️⃣   ⬜️⬛️⬜️⬛️⬜️⬛️⬜️⬛️   6️⃣
5️⃣   ⬛️⬜️⬛️⬜️⬛️⬜️⬛️⬜️   5️⃣
4️⃣   ⬜️⬛️⬜️⬛️⬜️⬛️⬜️⬛️   4️⃣
3️⃣   ⬛️⬜️⬛️⬜️⬛️⬜️⬛️⬜️   3️⃣
2️⃣   👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️   2️⃣
1️⃣   ✊🏻🦄💂🏻👸🏼🤴🏻💂🏻🦄✊🏻   1️⃣

#️⃣   [A][B][C][D] [E][F][G][H]   #️⃣`

const startBlackBoard = `#️⃣   [H][G][F][E] [D][C][B][A]   #️⃣

1️⃣   ✊🏻🦄💂🏻👸🏼🤴🏻💂🏻🦄✊🏻   1️⃣
2️⃣   👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️👮🏻‍♂️   2️⃣
3️⃣   ⬜️⬛️⬜️⬛️⬜️⬛️⬜️⬛️   3️⃣
4️⃣   ⬛️⬜️⬛️⬜️⬛️⬜️⬛️⬜️   4️⃣
5️⃣   ⬜️⬛️⬜️⬛️⬜️⬛️⬜️⬛️   5️⃣
6️⃣   ⬛️⬜️⬛️⬜️⬛️⬜️⬛️⬜️   6️⃣
7️⃣   👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️👮🏿‍♂️   7️⃣
8️⃣   ✊🏿🐴💂🏿👸🏿🤴🏿💂🏿🐴✊🏿   8️⃣

#️⃣   [H][G][F][E] [D][C][B][A]   #️⃣`

const getBoard = () => (state.state.white ? startWhiteBoard : startBlackBoard)

module.exports = {
  getBoard,
}
